; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=120, out_folder=./training, instance_id=0, seed=2024, goal_proportion=0.03

(define (problem blocksworld-00)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 - object)
 (:init 
    (arm-empty)
    (clear b35)
    (on b35 b110)
    (on b110 b72)
    (on-table b72)
    (clear b20)
    (on b20 b109)
    (on b109 b14)
    (on b14 b36)
    (on b36 b74)
    (on b74 b108)
    (on-table b108)
    (clear b59)
    (on b59 b73)
    (on b73 b77)
    (on b77 b85)
    (on b85 b12)
    (on b12 b62)
    (on b62 b38)
    (on b38 b1)
    (on b1 b66)
    (on-table b66)
    (clear b4)
    (on b4 b63)
    (on-table b63)
    (clear b86)
    (on-table b86)
    (clear b7)
    (on b7 b11)
    (on-table b11)
    (clear b5)
    (on b5 b29)
    (on b29 b52)
    (on-table b52)
    (clear b6)
    (on b6 b44)
    (on b44 b51)
    (on b51 b23)
    (on b23 b31)
    (on b31 b58)
    (on-table b58)
    (clear b47)
    (on b47 b25)
    (on-table b25)
    (clear b57)
    (on-table b57)
    (clear b99)
    (on-table b99)
    (clear b106)
    (on b106 b100)
    (on b100 b13)
    (on-table b13)
    (clear b9)
    (on-table b9)
    (clear b119)
    (on b119 b65)
    (on-table b65)
    (clear b78)
    (on b78 b120)
    (on-table b120)
    (clear b116)
    (on-table b116)
    (clear b71)
    (on b71 b22)
    (on b22 b105)
    (on b105 b96)
    (on b96 b103)
    (on b103 b102)
    (on b102 b37)
    (on b37 b117)
    (on b117 b21)
    (on b21 b33)
    (on b33 b104)
    (on b104 b17)
    (on b17 b56)
    (on b56 b2)
    (on b2 b49)
    (on b49 b15)
    (on b15 b48)
    (on b48 b3)
    (on b3 b90)
    (on b90 b30)
    (on b30 b83)
    (on b83 b87)
    (on b87 b41)
    (on b41 b80)
    (on-table b80)
    (clear b55)
    (on-table b55)
    (clear b76)
    (on b76 b115)
    (on-table b115)
    (clear b81)
    (on b81 b113)
    (on b113 b50)
    (on-table b50)
    (clear b42)
    (on b42 b18)
    (on b18 b16)
    (on b16 b88)
    (on-table b88)
    (clear b101)
    (on b101 b45)
    (on b45 b8)
    (on-table b8)
    (clear b112)
    (on b112 b111)
    (on b111 b107)
    (on b107 b19)
    (on b19 b84)
    (on-table b84)
    (clear b60)
    (on b60 b89)
    (on-table b89)
    (clear b27)
    (on b27 b10)
    (on b10 b67)
    (on-table b67)
    (clear b43)
    (on b43 b91)
    (on b91 b70)
    (on b70 b40)
    (on b40 b28)
    (on b28 b79)
    (on b79 b118)
    (on b118 b68)
    (on b68 b54)
    (on b54 b46)
    (on b46 b64)
    (on b64 b95)
    (on-table b95)
    (clear b82)
    (on-table b82)
    (clear b32)
    (on-table b32)
    (clear b69)
    (on b69 b34)
    (on b34 b98)
    (on b98 b92)
    (on-table b92)
    (clear b97)
    (on-table b97)
    (clear b53)
    (on b53 b93)
    (on-table b93)
    (clear b114)
    (on b114 b26)
    (on b26 b39)
    (on-table b39)
    (clear b75)
    (on b75 b94)
    (on b94 b24)
    (on b24 b61)
    (on-table b61))
 (:goal  (and 
    (clear b2)
    (on b2 b1)
    (on-table b1)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b59 b73)
   deleted: (on b59 b73) (clear b59) (arm-empty)
   added: (holding b59) (clear b73)
   goals met: 0 of 5
2. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 0 of 5
3. (unstack b71 b22)
   deleted: (on b71 b22) (clear b71) (arm-empty)
   added: (holding b71) (clear b22)
   goals met: 0 of 5
4. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 0 of 5
5. (unstack b22 b105)
   deleted: (on b22 b105) (clear b22) (arm-empty)
   added: (holding b22) (clear b105)
   goals met: 0 of 5
6. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 5
7. (unstack b105 b96)
   deleted: (on b105 b96) (clear b105) (arm-empty)
   added: (holding b105) (clear b96)
   goals met: 0 of 5
8. (putdown b105)
   deleted: (holding b105)
   added: (clear b105) (arm-empty) (on-table b105)
   goals met: 0 of 5
9. (unstack b73 b77)
   deleted: (on b73 b77) (clear b73) (arm-empty)
   added: (holding b73) (clear b77)
   goals met: 0 of 5
10. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 0 of 5
11. (unstack b77 b85)
   deleted: (on b77 b85) (clear b77) (arm-empty)
   added: (holding b77) (clear b85)
   goals met: 0 of 5
12. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 0 of 5
13. (unstack b85 b12)
   deleted: (on b85 b12) (clear b85) (arm-empty)
   added: (holding b85) (clear b12)
   goals met: 0 of 5
14. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 0 of 5
15. (unstack b12 b62)
   deleted: (on b12 b62) (clear b12) (arm-empty)
   added: (holding b12) (clear b62)
   goals met: 0 of 5
16. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 5
17. (unstack b62 b38)
   deleted: (on b62 b38) (clear b62) (arm-empty)
   added: (holding b62) (clear b38)
   goals met: 0 of 5
18. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 0 of 5
19. (unstack b38 b1)
   deleted: (on b38 b1) (clear b38) (arm-empty)
   added: (holding b38) (clear b1)
   goals met: 0 of 5
20. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 0 of 5
21. (unstack b1 b66)
   deleted: (on b1 b66) (clear b1) (arm-empty)
   added: (holding b1) (clear b66)
   goals met: 0 of 5
22. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 5
23. (unstack b96 b103)
   deleted: (on b96 b103) (clear b96) (arm-empty)
   added: (holding b96) (clear b103)
   goals met: 1 of 5
24. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 1 of 5
25. (unstack b103 b102)
   deleted: (on b103 b102) (clear b103) (arm-empty)
   added: (holding b103) (clear b102)
   goals met: 1 of 5
26. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 1 of 5
27. (unstack b102 b37)
   deleted: (on b102 b37) (clear b102) (arm-empty)
   added: (holding b102) (clear b37)
   goals met: 1 of 5
28. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 1 of 5
29. (unstack b37 b117)
   deleted: (on b37 b117) (clear b37) (arm-empty)
   added: (holding b37) (clear b117)
   goals met: 1 of 5
30. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 1 of 5
31. (unstack b117 b21)
   deleted: (on b117 b21) (clear b117) (arm-empty)
   added: (holding b117) (clear b21)
   goals met: 1 of 5
32. (putdown b117)
   deleted: (holding b117)
   added: (clear b117) (arm-empty) (on-table b117)
   goals met: 1 of 5
33. (unstack b21 b33)
   deleted: (on b21 b33) (clear b21) (arm-empty)
   added: (holding b21) (clear b33)
   goals met: 1 of 5
34. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 5
35. (unstack b33 b104)
   deleted: (on b33 b104) (clear b33) (arm-empty)
   added: (holding b33) (clear b104)
   goals met: 1 of 5
36. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 1 of 5
37. (unstack b104 b17)
   deleted: (on b104 b17) (clear b104) (arm-empty)
   added: (holding b104) (clear b17)
   goals met: 1 of 5
38. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 1 of 5
39. (unstack b17 b56)
   deleted: (on b17 b56) (clear b17) (arm-empty)
   added: (holding b17) (clear b56)
   goals met: 1 of 5
40. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 5
41. (unstack b56 b2)
   deleted: (on b56 b2) (clear b56) (arm-empty)
   added: (holding b56) (clear b2)
   goals met: 2 of 5
42. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 2 of 5
43. (unstack b2 b49)
   deleted: (on b2 b49) (clear b2) (arm-empty)
   added: (holding b2) (clear b49)
   goals met: 1 of 5
44. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 3 of 5
45. (unstack b49 b15)
   deleted: (on b49 b15) (clear b49) (arm-empty)
   added: (holding b49) (clear b15)
   goals met: 3 of 5
46. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 3 of 5
47. (unstack b15 b48)
   deleted: (on b15 b48) (clear b15) (arm-empty)
   added: (holding b15) (clear b48)
   goals met: 3 of 5
48. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 5
49. (unstack b48 b3)
   deleted: (on b48 b3) (clear b48) (arm-empty)
   added: (holding b48) (clear b3)
   goals met: 4 of 5
50. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 4 of 5
51. (unstack b3 b90)
   deleted: (on b3 b90) (clear b3) (arm-empty)
   added: (holding b3) (clear b90)
   goals met: 3 of 5
52. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 5 of 5
